cases/channelHartmann/Allrun
#!/bin/sh
# Fail loudly: the stock OpenFOAM Allrun carries on even when a step fails, so
# a run that produces nothing still looks successful.
set -e

cd "$(dirname "$0")" || exit 1

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication $(getApplication)
runApplication -s sample postProcess -func sample
