cases/channelHartmann/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Constant pressure gradient that drives the flow.
// f = grad(p)/rho = (1.309928e-05 0 0) m/s^2, chosen for Re = Ubar D_h/nu = 100, so the bulk velocity is an output.
momentumSource
{
    type            vectorSemiImplicitSource;

    selectionMode   all;

    volumeMode      specific;

    injectionRateSuSp
    {
        U           ((1.309928e-05 0 0) 0);
    }
}

// ************************************************************************* //
