cases/channelHartmann/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     mhdturbFoamQS;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         8000;

deltaT          10;
writeControl    runTime;
writeInterval   2000;

purgeWrite      0;

writeFormat     ascii;
writePrecision  10;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;

functions
{
    #includeFunc residuals
    #includeFunc volFieldValue
    #includeFunc sample
}

// ************************************************************************* //
