cases/channelHartmann/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            ("libsampling.so");

interpolationScheme cellPoint;
writeControl    writeTime;
setFormat       raw;

sets
(
    centreProfile
    {
        type    lineUniform;
        axis    distance;
        // Os extremos coincidem com os centros das celulas de parede, de
        // modo que os 100 pontos caem exactamente nos 100 centros de
        // celula e a amostragem reproduz o campo sem erro de
        // interpolacao.
        start   (10 -0.99 0.05);
        end     (10 0.99 0.05);
        nPoints 100;
    }
);

fields          ( U );

// ************************************************************************* //
