cases/channelHartmann/system/volFieldValue
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      volFieldValue;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            volFieldValue;
libs            ("libfieldFunctionObjects.so");

writeControl    timeStep;
writeInterval   20;

log             true;
writeFields     false;

operation       volAverage;
weightField     none;

fields          (U p);

// ************************************************************************* //
